Repository: emtpb/mca
Catalog: mca/locales/*/LC_MESSAGES/messages.po
Languages: de

source: Time
de: Zeit

source: Voltage
de: Spannung

source: Values
de: Werte

source: Increment
de: Inkrement

source: Sampling frequency
de: Abtastfrequenz

source: Measure time
de: Messzeit

source: Abscissa
de: Abszisse

source: No marker
de: Kein Marker

source: Point
de: Punkt

source: Circle
de: Kreis

source: Triangle down
de: Dreieck unten

source: Triangle up
de: Dreieck oben

source: Triangle left
de: Dreieck links

source: Triangle right
de: Dreieck rechts

source: Octagon
de: Achteck

source: Square
de: Quadrat

source: Pentagon
de: Fünfeck

source: Star
de: Stern

source: Hexagon
de: Sechseck

source: Color
de: Farbe

source: Blue
de: Blau

source: Green
de: Grün

source: Red
de: Rot

source: Cyan
de: Türkis

source: Yellow
de: Gelb

source: Black
de: Schwarz

source: White
de: Weiß

source: MCA
de: MKA

source: Developed by:
de: Entwickelt von:

source: Measurement Engineering Group
de: Fachgebiet Elektrische Messtechnik

source: Homepage:
de: Startseite:

source: Close
de: Schließen

source: Zoom in
de: Reinzoomen

source: Ctrl +
de: Strg +

source: Zoom out
de: Rauszoomen

source: Ctrl -
de: Strg -

source: Zoom original
de: Originalgröße

source: Copy
de: Kopieren

source: Ctrl+C
de: Strg+C

source: Paste
de: Einfügen

source: Cut
de: Ausschneiden

source: Ctrl+X
de: Strg+X

source: Delete
de: Löschen

source: Del
de: Entf

source: Clear
de: Alles löschen

source: Search...
de: Suchen...

source: Show tags
de: Tags anzeigen

source: New block
de: Neuer Block

source: Show plot
de: Plot anzeigen

source: Edit
de: Bearbeiten

source: Add Input
de: Input hinzufügen

source: Delete Input
de: Input löschen

source: Add Output
de: Output hinzufügen

source: Delete Output
de: Output löschen

source: Name of the Input:
de: Name des Inputs:

source: Name of the Output:
de: Name des Outputs:

source: Cancel
de: Abbrechen

source: Edit {}
de: {} bearbeiten

source: Description
de: Beschreibung

source: Parameters
de: Parameter

source: General
de: Allgemein

source: Metadata
de: Metadaten

source: Define the metadata for the outgoing signals. By default metadata is computed depending on the input metadata. In order to apply your own defined metadata untick the corresponding boxes.
de: Definiere die Metadaten für Ausgangssignale. Standardmäßig ergeben sich die Metadaten der ausgehenden Signale aus den Metadaten der eingehenden Signale. Um eigene Metadaten anzugeben, müssen die entsprechenden Haken entfernt werden.

source: Define the metadata for the outgoing signals.
de: Definiere die Metadaten für Ausgangssignale.

source: Plot options
de: Plotoptionen

source: Apply
de: Übernehmen

source: Could not apply the changed parameters and metadata!Continue editing or revert changes?
de: Die veränderten Parameter und Metadaten konnten nicht angewendet werden! Mit der Bearbeitung fortfahren oder Änderung rückgängig machen?

source: Continue
de: Fortfahren

source: Revert
de: Rückgängig

source: Output '{}' metadata:
de: Output '{}' Metadaten

source: Output {} metadata:
de: Output {} MetaDaten:

source: Abscissa quantity:
de: Abszissengröße:

source: Abscissa symbol:
de: Abszissensymbol:

source: Abscissa unit:
de: Abszisseneinheit:

source: Ordinate quantity:
de: Ordinatengröße:

source: Ordinate symbol:
de: Ordinatensymbol:

source: Ordinate unit:
de: Ordinateneinheit:

source: Automatically calculate abscissa metadata
de: Automatisch Abszissenmetadaten berechnen

source: Automatically calculate ordinate metadata
de: Automatisch Ordinatenmetadaten berechnen

source: Plot a signal
de: Plotte ein Signal

source: Previous
de: Vorheriger Wert

source: Next
de: Nächster Wert

source: Disconnect
de: Verbindung trennen

source: Cyclic structures are not allowed.
de: Zyklische Strukturen sind nicht erlaubt.

source: Signals have incompatible metadata.
de: Signale haben inkompatible Metadaten.

source: Signals have incompatible abscissas.
de: Signale haben inkompatible Abszissen.

source: Could not connect blocks
de: Blöcke konnten nicht verbunden werden

source: The document has been modified. Do you want to save your changes?
de: Das Dokument wurde verändert. Wollen Sie die Änderungen speichern?

source: Yes
de: Ja

source: No
de: Nein

source: File
de: Datei

source: Language
de: Sprache

source: About
de: Über

source: New
de: Neu

source: Open
de: Öffnen

source: Open Recent
de: Zuletzt geöffnet

source: Save
de: Speichern

source: Save as
de: Speichern als

source: Exit
de: Verlassen

source: Close Application
de: Programm beenden

source: Select a file to open
de: Auswählen um Datei zu öffnen

source: File does not exist
de: Die Datei existiert nicht

source: File has to be a .json
de: Datei muss eine .json sein

source: Are you sure you want to remove all blocks?
de: Sind Sie sicher, dass Sie alle Blöcke entfernen wollen?

source: untitled.json
de: Unbennant.json

source: Changes will be applied after restart.
de: Einstellungen werden nach Neustart übernommen.

source: Signal type
de: Signaltyp

source: Width
de: Breite

source: Height
de: Höhe

source: Shift
de: Verschieben

source: Generates a rectangle or triangle signal.
de: Generiert ein Rechteck- oder Dreiecksignal.

source: Rectangle
de: Rechteck

source: Triangle
de: Dreieck

source: Interpolate
de: Interpolierer

source: New abscissa
de: Neue Abszisse

source: Interpolation kind
de: Interpolationstyp

source: Interpolates the input signal by defining a new abscissa. The range of the new abscissa has to be within the range of the abscissa of the input signal.
de: Interpoliert das Eingangssignal, indem eine neue Abszisse definiert wird. Der Bereich der neuen Abszisse muss innerhalb des Bereichs der alten Abszisse liegen.

source: Zero, SLinear, Quadratic and Cubic refer to a spline interpolation of zeroth, first, second or third order. Previous and Next simply return the previous or next value of the point. Nearest rounds down
de: Null, SLinear, Quadratisch and Kubisch beziehen sich bei der Spline-Interpolation auf die nullte, erste, zweite und dritte Ordnung.

source: Quadratic
de: Quadratisch

source: Cubic
de: Kubisch

source: Zero
de: Null

source: Nearest
de: Nähester Wert

source: Autocorrelation
de: Autokorrelation

source: Computes the auto correlation function of the input signal. The auto correlation measures a signals similarity to a time-shifted version of itself.
de: Berechnet die Autokorrelationsfunktion des Eingangssignals. Die Autokorrelationsfunktion gibt an wie ähnlich ein zeitverschobenes Signalzum ursprünglichen Signal ist.

source: Signal Generator (Periodic)
de: Signalgenerator (Periodisch)

source: Frequency
de: Frequenz

source: Amplitude
de: Maximalwert

source: Generates a periodic sinus, rectangle or triangle signal.
de: Generiert ein periodisches Sinus-, Rechteck- oder Dreiecksignal.

source: Sine
de: Sinus

source: Real-Complex
de: Real-Komplex

source: Real part
de: Realteil

source: Imaginary part
de: Imaginärteil

source: Combines two real signals into a complex signal. The signal of the first input turns into the real part of the output signal and the signal of the second input turns into the imaginary part of output signal.
de: Kombiniert zwei reellwertige Signal zu einem komplexen Signal. Das Signal am ersten Eingang entspricht dem Realteil des komplexen Ausgangssignals und das Signal am zweiten Eingang entspricht dem Imaginärteil des Ausgangssignals.

source: Channel 1
de: Kanal 1

source: Channel 2
de: Kanal 2

source: Device
de: Gerät

source: Connect
de: Verbinden

source: ADC Resolution
de: ADU Auflösung

source: Sample Frequency
de: Samplingfrequenz

source: Record Length
de: Aufnahmelänge

source: Measure
de: Messen

source: Trigger Kind
de: Trigger Art

source: Measure and extract data from a Handyscope oscilloscope
de: Misst und extrahiert Daten von einem Handyscope Oszilloskop

source: Rising Edge
de: Steigende Flanke

source: Falling Edge
de: Fallende Flanke

source: Complex-Real
de: Komplex-Real

source: Separates the real and imaginary part of the input signal into two output signals. First output yields the real part and second output yields the imaginary part.
de: Teilt Real- und Imaginärteil des Eingangssignals in zwei Ausgangssignale auf. Der erste Ausgang liefert des Realteil und der zweite Ausgang des Imginärteil

source: Filename
de: Dateiname

source: Export file
de: Datei exportieren

source: Exports the input signal as a .npz, .mat, .hdf5 file.
de: Exportiert das Eingangssignal als .npz, .mat, .hdf5 file.

source: Resamples the input signal.
de: Tastet das Eingangssignal neu ab.

source: Normalization
de: Quantisierer

source: Normalizes input signal by the specified range (By default 0-1).
de: Normalisiert das Eingangssignal auf den angebeben Wertebereich (Standardmäßig 0-1).

source: Sweep Kind
de: Sweepart

source: Start Frequency
de: Startfrequenz

source: End Frequency
de: Endfrequenz

source: Generates a chirp signal. Two frequencies have to be specified where the first frequency corresponds to the frequency at the beginning of the signal and second frequency corresponds to the frequency at the end of the signal.
de: Generiert ein Chirpsignal. Es müssen zwei Frequenzen angegeben werden.Die erste Frequenz entspricht der Startfrequenz und die zweite Frequenzentspricht der Endfrequenz.

source: Logarithmic
de: Logarithmisch

source: Hyperbolic
de: Hyperbolisch

source: Sampling Frequency
de: Samplingfrequenz

source: Record time
de: Aufnahmezeit

source: Record sound
de: Sound aufnehmen

source: Records a sound via the default audio input device.
de: Nimmt ein Audiosignal mithilfe des standardmäßigen Audiogeräts auf.

source: Convolution
de: Faltung

source: Computes the convolution of the two input signals.
de: Berechnet die Faltung der beiden Eingangssignale.

source: Full: Returns the full convolution with the length of M+N-1. Same: Returns the convolution of length max(N,M). Valid: Returns the convolution only where both input signals fully overlap.
de: Voll: Gibt die volle Faltung zurück mit der Länge M+N-1. Gleich: Gibt die Faltung mit der Länge max(N,M) zurück. Valid: Gibt die Faltung zurück wo beide Eingangssignale sich überlappen.

source: Full
de: Voll

source: Same
de: Gleich

source: Valid
de: Valide

source: Manually set sampling frequency
de: Manuell die Samplingfrequenz einstellen

source: Play sound
de: Audiosignal abspielen

source: Auto play
de: Automatisch abspielen

source: Normalize
de: Normiert

source: Plays the input signal as a sound by using the current default sound device.
de: Spielt das Eingangssignal als Audiosignal ab. Dabei wird das standardmäßige Audiogerät verwendet.

source: Normalize the input signal to have a maximum of value of 1
de: Normalisiert das Eingangssignal, sodass das Maximum 1 entspricht

source: Plot kind
de: Plottyp

source: Abscissa scaling
de: Abszissenskalierung

source: Ordinate scaling
de: Ordinatensskalierung

source: Plots all input signals as lines, stems or bars in a single figure.
de: Plottet alle Eingangssignale als Linien-, Stem- oder Barplot in einer Abbildung

source: Line
de: Linie

source: Log
de: Logarithmisch

source: Symmetrcial log
de: Symetrisch Logarithmisch

source: Import file
de: Datei importieren

source: Imports a signal from a file (previously exported by Signal Export).
de: Importiert das ein Signal (Zuvor mit Signal Export exportiert)

source: Window
de: Fensterung

source: Segment Length
de: Segmentlänge

source: Segment Overlap
de: Segmentüberlappung

source: FFT Length
de: FFT Länge

source: Plots the Short-Time Fourier Transformation of the input signal.
de: Plottet die Kurzeit Fourier-Tranformation des Eingangssignals.

source: Dead Time Values
de: Totzeit Werte

source: Shift the signal by the dead time
de: Verschibt das signal mit der angegebenen Totzeit

source: Zero Padding Values
de: Zeropadding Werte

source: Adds dead time and zero padding to the input signal.
de: Fügt dem Eingangssignal Totzeit und Zeropadding hinzu.

source: Multiplier
de: Multiplizierer

source: Multiplies the input signals with each other.
de: Multipliziert die Eingangssignale miteinander.

source: Export as .wav
de: Als .wav exportieren

source: Exports the input signal as a .wav sound file.
de: Exportiert das Eingangssignal als .wav Datei.

source: Power Spectrum
de: Leistungsspektrum

source: Scaling
de: Skalierung

source: Computes the power spectrum of the input signal using Welch's method
de: Berechnet das Leistungsspektrum des Eingangssignals nach Welch's Methode.

source: Integration rule
de: Integrationsregel

source: Computes the numerical integration of the input signal.
de: Berechnet die numerische Integration des Eingangssignals.

source: Trapezoidal
de: Trapez

source: Rectangular
de: Rechteck

source: Shift to ordinate
de: Zur Ordinate verschieben

source: Plot Mode
de: Plotmodus

source: Marker color
de: Markerfarbe

source: Computes the FFT of the input signal and plots either the real part, imaginary part, the absolute or the phase of the FFT. Shifts the FFT optionally or cuts the inputsignal before the conversion.
de: Berechnet die FFT des Eingangssignals und plottet entweder den Realteil, den Imaginärteil, den Betrag oder die Phase der FFT. Kann die negativen Frequenzen verschieben oder diese wegschneiden.

source: Normalize the FFT by dividing with the total amount of values
de: Normalisiert die FFT, indem durch die Anzahl der Werte geteilt wird

source: No shift
de: Kein Verschieben

source: Shift and only positive frequencies
de: Verschieben und nur positive Frequenzen

source: Imaginary
de: Imaginär

source: Absolute
de: Betrag

source: Input signal for ordinate axis
de: Eingangssignal für die Ordinatenachse

source: Input signal for abscissa axis
de: Eingangssignal für die Abszissenachse

source: Plots the ordinates of the input signals against each other.
de: Plottet die Ordinaten der Eingangssignale gegeneinander.

source: First
de: Erster

source: Second
de: Zweiter

source: Complex Plot
de: Komplex Plot

source: Plot type
de: Plotvariante

source: Marker Color
de: Markerfarbe

source: Real/Absolute
de: Real/Betrag

source: Imag/Phase
de: Imaginär/Phase

source: Plots absolute and phase or real and imaginary part of the input signal.
de: Plottet Betrag und Phase oder Real- und Imaginärteil des Eingangsignals.

source: Real/Imaginary
de: Real/Imaginär

source: Absolute/Phase
de: Betrag/Phase

source: Impulse
de: Impuls

source: Pulse length
de: Pulslänge

source: Shift of the pulse
de: Verschiebung des Pulses

source: Generates an impulse signal. Note that the pulse length and the shift have no units and are related to the amount of values which are set by the abscissa parameter.
de: Generiert ein Impulssignal. Beachte, dass die Pulslänge und die Verschiebungkeine Einheit haben und sich auf die Anzahl der Abszissenwerte beziehen.

source: Amount of values to shift on the abscissa
de: Anzahl der Werte, die auf der Abszisse verschoben werden sollen

source: Divider
de: Dividierer

source: Divides the two input signals.
de: Dividiert die beiden Eingangssignale.

source: Differentiator
de: Differenzierer

source: Computes the gradient of the input signal.
de: Berechnet den Gradienten des Eingangssignals.

source: Filter type
de: Filtertyp

source: Characteristic
de: Charakteristik

source: Order
de: Ordnung

source: Cut off frequency
de: Grenzfrequenz

source: Upper cut off frequency
de: Obere Grenzfrequenz

source: Ripple
de: Welligkeit

source: Attenuation
de: Dämpfung

source: Phase correction (filtfilt)
de: Phasenkorrektur (filtfilt)

source: Filters with common IIR filters the input signal. The upper cut off frequency is ignored when 'lowpass' or 'highpass' are selected as the characteristic. For specific 'Filter types' certain parameters are ignored as well.
de: Filtert mithilfe von gewöhnlichen IIR Filtern das Eingangssignal. Die obere Grenzfrequenz wird ignoriert, wenn 'Tiefpass' oder 'Hochpass' als Charakteristik ausgewählt ist. Für spezifische 'Filtertypen' werden bestimmte Parameter auch ignoriert.

source: For bandpass and bandstop this is used at the lower cut off frequency
de: Für den Bandpass und den Bandstop wird dieser Parameter als untere "Grenzfrequenz verwendet

source: Only valid for bandpass and bandstop
de: Nur gültig für den Bandpass und den Bandstop

source: The minimum attenuation required in the stop band.Only available for Cheby2 and Elliptic
de: Die minimale Dämpfung benötigt für den Sperrbereich. Nur für Cheby2 und Elliptisch verfügbar

source: Elliptic
de: Elliptisch

source: Lowpass
de: Tiefpass

source: Highpass
de: Hochpass

source: Cross Power Spectrum
de: Kreuzleistungsspektrum

source: Computes the cross power spectrum of the input signals. The cross power spectrum measures the similarity between two signals in the frequency domain
de: Berechnet das Kreuzleistungssprektrum der Eingangssignale. Das Kreuzleistungssprektrum misst die Ähnlichkeit zweier Signale im Frequenzbereich.

source: Analytical Signal
de: Analytischessignal

source: Computes the analytical signal of the input signal using the Hilbert transform.
de: Berechnet das analytische Signal des Eingangssignals mithilfe der Hilbertransformation.

source: Start value
de: Startwert

source: End value
de: Endwert

source: Cuts out a part of the input signal and puts the cut out signal to the output. Start and end values have to be in range of the abscissa values. Values within the abscissa range which do not match any sampling get rounded down.
de: Schneidet einen Teil des Eingangssignals heraus und gibt den ausgeschnittenen Teil an den Ausgang. Start- und Endwerte müssen im Bereich der Abszissenwerte liegen. Werte, die im Bereich der Abszisse liegen, aber nicht direkt einem Abtastwert entsprechen, werden abgerundet.

source: Adder
de: Addierer

source: Adds multiple signals to one signal.
de: Addiert mehrere Signale zu einem Signal.

source: Gauss Pulse
de: Gausspuls

source: Envelope
de: Einhüllende

source: Center Frequency
de: Mittenfrequenz

source: Fractional bandwidth
de: Normierte Bandbreite

source: Reference level
de: Referenzpegel

source: Generates a gaussian pulse signal. Returns real- and imaginary part as well as the envelope.
de: Generiert ein Gausspulssignal. Gibt Real-, Imaginärteil und die Einhüllende zurück.

source: Signal Generator (Stochastic)
de: Signalgenerator (Stochastisch)

source: Distribution
de: Verteilung

source: Mean µ
de: Mittelwert µ

source: Standard deviation σ
de: Standardabweichung σ

source: Generates a stochastic signal with either normal or equal distribution.
de: Generiert ein stochastisches Signal mit einer Normal- oder Gleichverteilung.

source: Normal distribution
de: Normalverteilt

source: Uniform distribution
de: Gleichverteilung

source: Bins
de: Klassen

source: Align
de: Ausrichtung

source: Plots absolute and relative density frequency of occurrences of values in a histogramm.
de: Plottet die absolute und relative Häufigkeit als auch die relative Häufigkeitsdichte der Werte des Eingangssignals als Histogramm

source: Absolute frequency
de: Absolute Häufigkeit

source: Relative frequency
de: Relative Häufigkeit

source: Relative (density frequency)
de: Relative Häufigkeitsdichte

source: Left
de: Links

source: Mid
de: Mittig

source: Right
de: Rechts

source: Window Function
de: Fenster Funktion

source: Standard Deviation (Gaussian)
de: Standardabweichung (Gauß)

source: Applies a window function to the input signal.
de: Wendet eine Fensterfunktion auf das Eingangssignal an.

source: Exponential
de: Exponentiell

source: Gaussian
de: Gauß

source: Perform an FFT shift on the input signal.
de: Wendet eine Fensterfunktion auf das Eingangssignal an.

source: Crosscorrelation
de: Kreuzkorrelation

source: Computes the cross correlation function of the input signals. The cross correlation measures the similarity between to signals at different time offsets.
de: Berechnet die Kreuzkorrelationsfunktion der beiden Eingangssignale. Die Kreuzkorrelation misst die Ähnlichekit zwischen zwei Signalen mit verschiedenenZeitverschiebungen.

source: Imports a .wav to create an output signal. Minimum and maximum value depend on the .wav format provided (see reference)
de: Importiert eine .wav Datei um ein Ausgangssignal zu erzeugen. Der minimale und maximale Wert hängen .wav-Format ab.

source: Normalize the signal by dividing by the absolute maximum value
de: Normalisiert das Signal, indem es durch den absoluten maximalen Wertgeteilt wird

source: Limiter
de: Begrenzer

source: Threshold
de: Schwellenwert

source: Limits the values of the input signal. Values exceeding this limit get set to the threshold.
de: Begrenzt die Werte des Eingangssignals. Werte, die über das Limit hinausgehen, werden auf den Grenzwert gesetzt.

source: Computes the absolute of the input signal.
de: Berechnet den Betrag des Eingangssignals.

source: Downsampling factor
de: Downsamplingfaktor

source: Downsample the input signal by taking only nth-data point. The overall length of the signal approximately stays the same.
de: Reduziert die Anzahl der Datenpunkte des Eingangssignal um einen Faktor.

source: The amount of samples to reduce. A factor of 10 only keeps every 10th sample
de: Die Anzahl an Samples die reduziert werden sollen. Ein Faktor von 10 behält jedes 10. Sample

source: Factor of the 0th order (x⁰)
de: Faktor der 0. Ordnung (x⁰)

source: Factor of the 1st order (x¹)
de: Faktor der 1. Ordnung (x²)

source: Factor of the 2nd order (x²)
de: Faktor der 2. Ordnung (x³)

source: Factor of the 3rd order (x³)
de: Faktor der 3. Ordnung x³

source: Factor of the 4th order (x⁴)
de: Faktor der 4. Ordnung (x⁴)

source: Factor of the 5th order (x⁵)
de: Faktor der 5. Ordnung (x⁵)

source: Generates a signal based on a polynomial function with the maximum order of 5 (a*x⁵+b*x⁴+c*x³+d*x²+e*x¹+f*x⁰)
de: Generiert ein Signal basierend auf einer Polynomfunktion mit einer maximalen Ordnung von 5.

source: Quantization
de: Quantisierer

source: Max value
de: Max. Wert

source: Signed
de: Vorzeichenbehaftet

source: Raw bits
de: Bitwerte zurückgeben

source: Quantizes the input signal by a given amount of bits. Returns optionally the raw bit values.
de: Quantisiert das Eingangssignal mit einer gegebenen Anzahl von Bits. Gibt optional auch die Bitwerte zurück.

source: Computes the FFT or the inverse FFT of the input signal.
de: Berechnet die FFT oder die inverse FFT des Eingangssignals.

source: Compute the inverse FFT
de: Berechne die die inverse FFT

source: Computes the envelope of the input signal. It is given by the magnitude of the analytical signal (hilbert transformation)
de: Berechnet die Einhüllende des Eingangssignals gegeben durch den Betrades analytischen Signals (Hilbert Transformation)

source: DC Value
de: DC Wert

source: Generates a DC signal.
de: Generiert ein DC Signal.

source: Amplifier
de: Verstärker

source: Factor
de: Faktor

source: Decibel
de: Dezibel

source: Amplification
de: Verstärkung

source: Amplifies the input signal by the desired factor.
de: Verstärkt das Eingangssignal mit dem angebenen Faktor.

source: Generating
de: Generierung

source: Export
de: Exportieren

source: Import
de: Importieren

source: Plotting
de: Plotten

source: Fourier transform
de: Fouriertransformation

source: Stochastic
de: Stochastisch

source: Processing
de: Verarbeitung
